zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70064.atdf
        <module name="AES" id="6149" version="W">
          <instance name="AES">
            <register-group address-space="base" name="AES" name-in-module="AES" offset="0x4006C000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="37"/>
              <param name="DMAC_ID_RX" value="38"/>
              <param name="INSTANCE_ID" value="56"/>
              <param name="CLOCK_ID" value="56"/>
            </parameters>
          </instance>
        </module>
        <module name="AFEC" id="11147" version="S">
          <instance name="AFEC0">
            <register-group address-space="base" name="AFEC0" name-in-module="AFEC" offset="0x4003C000"/>
            <signals>
              <signal pad="PA08" function="B" group="ADTRG"/>
              <signal pad="PA21" function="X1" group="AD" index="1"/>
              <signal pad="PB03" function="X1" group="AD" index="2"/>
              <signal pad="PB02" function="X1" group="AD" index="5"/>
              <signal pad="PB00" function="X1" group="AD" index="10"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="35"/>
              <param name="INSTANCE_ID" value="29"/>
              <param name="CLOCK_ID" value="29"/>
              <param caption="External ADC Trigger Input (AFE0_ADTRG pin)" name="TRGSEL_AFEC_TRIG0" value="0x0"/>
              <param caption="TC0 Channel 0 Output (TIOA0)" name="TRGSEL_AFEC_TRIG1" value="0x1"/>
              <param caption="TC0 Channel 1 Output (TIOA1)" name="TRGSEL_AFEC_TRIG2" value="0x2"/>
              <param caption="TC0 Channel 2 Output (TIOA2)" name="TRGSEL_AFEC_TRIG3" value="0x3"/>
              <param caption="PWM0 event line 0" name="TRGSEL_AFEC_TRIG4" value="0x4"/>
              <param caption="PWM0 event line 1" name="TRGSEL_AFEC_TRIG5" value="0x5"/>
              <param caption="Analog Comparator Fault Output" name="TRGSEL_AFEC_TRIG6" value="0x6"/>
              <param caption="Temperature Sensor Channel" name="TEMP_SENSOR_CH_NUM" value="11"/>
            </parameters>
          </instance>
          <instance name="AFEC1">
            <register-group address-space="base" name="AFEC1" name-in-module="AFEC" offset="0x40064000"/>
            <signals>
              <signal pad="PD09" function="C" group="ADTRG"/>
              <signal pad="PB01" function="X1" group="AD" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="36"/>
              <param name="INSTANCE_ID" value="40"/>
              <param name="CLOCK_ID" value="40"/>
              <param caption="External ADC Trigger Input (AFE1_ADTRG Pin)" name="TRGSEL_AFEC_TRIG0" value="0x0"/>
              <param caption="TC1 Channel 0 Output (TIOA3)" name="TRGSEL_AFEC_TRIG1" value="0x1"/>
              <param caption="TC1 Channel 1 Output (TIOA4)" name="TRGSEL_AFEC_TRIG2" value="0x2"/>
              <param caption="TC1 Channel 2 Output (TIOA5)" name="TRGSEL_AFEC_TRIG3" value="0x3"/>
              <param caption="PWM1 event line 0" name="TRGSEL_AFEC_TRIG4" value="0x4"/>
              <param caption="PWM1 event line 1" name="TRGSEL_AFEC_TRIG5" value="0x5"/>
              <param caption="Analog Comparator Fault Output" name="TRGSEL_AFEC_TRIG6" value="0x6"/>
            </parameters>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZK">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0940"/>
          </instance>
        </module>
        <module name="DACC" id="11246" version="E">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x40040000"/>
            <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PD00" function="X1" group="DAC" index="1"/>
              <signal pad="PA02" function="C" group="DATRG"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_CH0_TX" value="30"/>
              <param name="DMAC_ID_CH1_TX" value="31"/>
              <param name="INSTANCE_ID" value="30"/>
              <param name="CLOCK_ID" value="30"/>
            </parameters>
          </instance>
        </module>
        <module name="EFC" id="6450" version="Y">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0C00"/>
            <signals>
              <signal pad="PB12" function="X1" group="ERASE"/>
            </signals>
            <parameters>
              <param name="FLASH_SIZE" value="2097152"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="INSTANCE_ID" value="6"/>
              <param name="PAGES_PR_REGION" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="GMAC" id="11046" version="S">
          <instance name="GMAC">
            <register-group address-space="base" name="GMAC" name-in-module="GMAC" offset="0x40050000"/>
            <signals>
              <signal pad="PD10" function="A" group="GCRS"/>
              <signal pad="PD08" function="A" group="GMDC"/>
              <signal pad="PD09" function="A" group="GMDIO"/>
              <signal pad="PD04" function="A" group="GRXDV"/>
              <signal pad="PD07" function="A" group="GRXER"/>
              <signal pad="PD05" function="A" group="GRX" index="0"/>
              <signal pad="PD06" function="A" group="GRX" index="1"/>
              <signal pad="PD11" function="A" group="GRX" index="2"/>
              <signal pad="PD12" function="A" group="GRX" index="3"/>
              <signal pad="PB01" function="B" group="GTSUCOMP"/>
              <signal pad="PB12" function="B" group="GTSUCOMP"/>
              <signal pad="PD11" function="C" group="GTSUCOMP"/>
              <signal pad="PD00" function="A" group="GTXCK"/>
              <signal pad="PD01" function="A" group="GTXEN"/>
              <signal pad="PD02" function="A" group="GTX" index="0"/>
              <signal pad="PD03" function="A" group="GTX" index="1"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="39"/>
              <param name="CLOCK_ID" value="39"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="J">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1890"/>
