zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70064.atdf
          </instance>
        </module>
        <module name="ICM" id="11105" version="H">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0x40048000"/>
            <parameters>
              <param name="INSTANCE_ID" value="32"/>
              <param name="CLOCK_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="ISI" id="6350" version="K">
          <instance name="ISI">
            <register-group address-space="base" name="ISI" name-in-module="ISI" offset="0x4004C000"/>
            <signals>
              <signal pad="PD22" function="D" group="D" index="0"/>
              <signal pad="PD21" function="D" group="D" index="1"/>
              <signal pad="PB03" function="D" group="D" index="2"/>
              <signal pad="PA09" function="B" group="D" index="3"/>
              <signal pad="PA05" function="B" group="D" index="4"/>
              <signal pad="PD11" function="D" group="D" index="5"/>
              <signal pad="PD12" function="D" group="D" index="6"/>
              <signal pad="PA27" function="D" group="D" index="7"/>
              <signal pad="PD31" function="D" group="D" index="11"/>
              <signal pad="PD24" function="D" group="HSYNC"/>
              <signal pad="PA24" function="D" group="PCK"/>
              <signal pad="PD25" function="D" group="VSYNC"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="59"/>
              <param name="CLOCK_ID" value="59"/>
            </parameters>
          </instance>
        </module>
        <module name="MATRIX" id="11282" version="L">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x40088000"/>
          </instance>
        </module>
        <module name="MCAN" id="11273" version="N">
          <instance name="MCAN0">
            <register-group address-space="base" name="MCAN0" name-in-module="MCAN" offset="0x40030000"/>
            <signals>
              <signal pad="PB03" function="A" group="CANRX" index="0"/>
              <signal pad="PB02" function="A" group="CANTX" index="0"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="35"/>
              <param name="CLOCK_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="MLB" id="11287" version="E">
          <instance name="MLB">
            <register-group address-space="base" name="MLB" name-in-module="MLB" offset="0x40068000"/>
            <signals>
              <signal pad="PB04" function="C" group="MLBCLK"/>
              <signal pad="PB05" function="C" group="MLBDAT"/>
              <signal pad="PD10" function="D" group="MLBSIG"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="53"/>
              <param name="CLOCK_ID" value="53"/>
            </parameters>
          </instance>
        </module>
        <module name="PIO" id="11004" version="V">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
            <signals>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal pad="PA03" function="X1" group="PIODC" index="0"/>
              <signal pad="PA04" function="X1" group="PIODC" index="1"/>
              <signal pad="PA05" function="X1" group="PIODC" index="2"/>
              <signal pad="PA09" function="X1" group="PIODC" index="3"/>
              <signal pad="PA10" function="X1" group="PIODC" index="4"/>
              <signal pad="PA11" function="X1" group="PIODC" index="5"/>
              <signal pad="PA12" function="X1" group="PIODC" index="6"/>
              <signal pad="PA13" function="X1" group="PIODC" index="7"/>
              <signal pad="PA14" function="X1" group="PIODCEN" index="1"/>
              <signal pad="PA21" function="X1" group="PIODCEN" index="2"/>
              <signal pad="PA22" function="X1" group="PIODCCLK"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="34"/>
              <param name="INSTANCE_ID" value="10"/>
              <param name="CLOCK_ID" value="10"/>
            </parameters>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
            <signals>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="33" function="default" pad="PB01"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="36" function="default" pad="PB04"/>
              <signal group="P" index="37" function="default" pad="PB05"/>
              <signal group="P" index="38" function="default" pad="PB06"/>
              <signal group="P" index="39" function="default" pad="PB07"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
              <param name="CLOCK_ID" value="11"/>
            </parameters>
          </instance>
          <instance name="PIOD">
            <register-group address-space="base" name="PIOD" name-in-module="PIO" offset="0x400E1400"/>
            <signals>
              <signal group="P" index="96" function="default" pad="PD00"/>
              <signal group="P" index="97" function="default" pad="PD01"/>
              <signal group="P" index="98" function="default" pad="PD02"/>
              <signal group="P" index="99" function="default" pad="PD03"/>
              <signal group="P" index="100" function="default" pad="PD04"/>
              <signal group="P" index="101" function="default" pad="PD05"/>
              <signal group="P" index="102" function="default" pad="PD06"/>
              <signal group="P" index="103" function="default" pad="PD07"/>
              <signal group="P" index="104" function="default" pad="PD08"/>
              <signal group="P" index="105" function="default" pad="PD09"/>
              <signal group="P" index="106" function="default" pad="PD10"/>
              <signal group="P" index="107" function="default" pad="PD11"/>
              <signal group="P" index="108" function="default" pad="PD12"/>
              <signal group="P" index="117" function="default" pad="PD21"/>
              <signal group="P" index="118" function="default" pad="PD22"/>
              <signal group="P" index="120" function="default" pad="PD24"/>
              <signal group="P" index="121" function="default" pad="PD25"/>
              <signal group="P" index="122" function="default" pad="PD26"/>
              <signal group="P" index="127" function="default" pad="PD31"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="16"/>
              <param name="CLOCK_ID" value="16"/>
            </parameters>
          </instance>
        </module>
        <module name="PMC" id="44006" version="P">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0600"/>
            <signals>
              <signal pad="PA06" function="B" group="PCK" index="0"/>
              <signal pad="PB12" function="D" group="PCK" index="0"/>
              <signal pad="PB13" function="B" group="PCK" index="0"/>
              <signal pad="PA17" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="1"/>
              <signal pad="PA03" function="C" group="PCK" index="2"/>
              <signal pad="PA18" function="B" group="PCK" index="2"/>
              <signal pad="PA31" function="B" group="PCK" index="2"/>
              <signal pad="PB03" function="B" group="PCK" index="2"/>
              <signal pad="PD31" function="C" group="PCK" index="2"/>
              <signal pad="PB09" function="X1" group="XIN"/>
              <signal pad="PB08" function="X1" group="XOUT"/>
              <signal pad="PA07" function="X1" group="XIN32"/>
              <signal pad="PA08" function="X1" group="XOUT32"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="PWM" id="6343" version="Y">
          <instance name="PWM0">
            <register-group address-space="base" name="PWM0" name-in-module="PWM" offset="0x40020000"/>
            <signals>
              <signal pad="PA10" function="B" group="PWMEXTRG" index="0"/>
              <signal pad="PA22" function="B" group="PWMEXTRG" index="1"/>
              <signal pad="PA09" function="C" group="PWMFI" index="0"/>
              <signal pad="PD08" function="B" group="PWMFI" index="1"/>
              <signal pad="PD09" function="B" group="PWMFI" index="2"/>
              <signal pad="PA00" function="A" group="PWMH" index="0"/>
              <signal pad="PA11" function="B" group="PWMH" index="0"/>
              <signal pad="PA23" function="B" group="PWMH" index="0"/>
              <signal pad="PB00" function="A" group="PWMH" index="0"/>
              <signal pad="PD11" function="B" group="PWMH" index="0"/>
              <signal pad="PD20" function="A" group="PWMH" index="0"/>
              <signal pad="PA02" function="A" group="PWMH" index="1"/>
              <signal pad="PA12" function="B" group="PWMH" index="1"/>
              <signal pad="PA24" function="B" group="PWMH" index="1"/>
              <signal pad="PB01" function="A" group="PWMH" index="1"/>
              <signal pad="PD21" function="A" group="PWMH" index="1"/>
              <signal pad="PA13" function="B" group="PWMH" index="2"/>
              <signal pad="PA25" function="B" group="PWMH" index="2"/>
              <signal pad="PB04" function="B" group="PWMH" index="2"/>
              <signal pad="PD22" function="A" group="PWMH" index="2"/>
              <signal pad="PA07" function="B" group="PWMH" index="3"/>
              <signal pad="PA14" function="B" group="PWMH" index="3"/>
              <signal pad="PA17" function="C" group="PWMH" index="3"/>
              <signal pad="PD23" function="A" group="PWMH" index="3"/>
              <signal pad="PA01" function="A" group="PWML" index="0"/>
              <signal pad="PA19" function="B" group="PWML" index="0"/>
              <signal pad="PB05" function="B" group="PWML" index="0"/>
              <signal pad="PD10" function="B" group="PWML" index="0"/>
              <signal pad="PD24" function="A" group="PWML" index="0"/>
              <signal pad="PA20" function="B" group="PWML" index="1"/>
              <signal pad="PB12" function="A" group="PWML" index="1"/>
              <signal pad="PD25" function="A" group="PWML" index="1"/>
              <signal pad="PA16" function="C" group="PWML" index="2"/>
              <signal pad="PA30" function="A" group="PWML" index="2"/>
              <signal pad="PB13" function="A" group="PWML" index="2"/>
              <signal pad="PD26" function="A" group="PWML" index="2"/>
              <signal pad="PA15" function="C" group="PWML" index="3"/>
              <signal pad="PD27" function="A" group="PWML" index="3"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="13"/>
              <param name="INSTANCE_ID" value="31"/>
              <param name="CLOCK_ID" value="31"/>
              <param name="FAULT_PWM_ID0" value="0x0" caption="Fault 0 - PWM0_PWMFI0 Input pin"/>
              <param name="FAULT_PWM_ID1" value="0x1" caption="Fault 1 - PWM0_PWMFI1 Input pin"/>
              <param name="FAULT_PWM_ID2" value="0x2" caption="Fault 2 - PWM0_PWMFI2 Input pin"/>
              <param name="FAULT_PWM_ID3" value="0x3" caption="Fault 3 - MAIN_OSC_PMC"/>
              <param name="FAULT_PWM_ID4" value="0x4" caption="Fault 4 - AFEC0"/>
              <param name="FAULT_PWM_ID5" value="0x5" caption="Fault 5 - AFEC1"/>
              <param name="FAULT_PWM_ID6" value="0x6" caption="Fault 6 - ACC"/>
              <param name="FAULT_PWM_ID7" value="0x7" caption="Fault 7 - TC0"/>
            </parameters>
          </instance>
          <instance name="PWM1">
            <register-group address-space="base" name="PWM1" name-in-module="PWM" offset="0x4005C000"/>
            <signals>
              <signal pad="PA30" function="B" group="PWMEXTRG" index="0"/>
              <signal pad="PA18" function="A" group="PWMEXTRG" index="1"/>
              <signal pad="PA21" function="C" group="PWMFI" index="0"/>
              <signal pad="PA26" function="D" group="PWMFI" index="1"/>
              <signal pad="PA28" function="D" group="PWMFI" index="2"/>
              <signal pad="PA12" function="C" group="PWMH" index="0"/>
              <signal pad="PD01" function="B" group="PWMH" index="0"/>
              <signal pad="PA14" function="C" group="PWMH" index="1"/>
              <signal pad="PD03" function="B" group="PWMH" index="1"/>
              <signal pad="PA31" function="D" group="PWMH" index="2"/>
              <signal pad="PD05" function="B" group="PWMH" index="2"/>
              <signal pad="PA08" function="A" group="PWMH" index="3"/>
              <signal pad="PD07" function="B" group="PWMH" index="3"/>
              <signal pad="PA11" function="C" group="PWML" index="0"/>
              <signal pad="PD00" function="B" group="PWML" index="0"/>
              <signal pad="PA13" function="C" group="PWML" index="1"/>
              <signal pad="PD02" function="B" group="PWML" index="1"/>
              <signal pad="PA23" function="D" group="PWML" index="2"/>
              <signal pad="PD04" function="B" group="PWML" index="2"/>
              <signal pad="PA05" function="A" group="PWML" index="3"/>
              <signal pad="PD06" function="B" group="PWML" index="3"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="39"/>
              <param name="INSTANCE_ID" value="60"/>
              <param name="CLOCK_ID" value="60"/>
              <param name="FAULT_PWM_ID0" value="0x0" caption="Fault 0 - PWM0_PWMFI0 Input pin"/>
              <param name="FAULT_PWM_ID1" value="0x1" caption="Fault 1 - PWM0_PWMFI1 Input pin"/>
              <param name="FAULT_PWM_ID2" value="0x2" caption="Fault 2 - PWM0_PWMFI2 Input pin"/>
              <param name="FAULT_PWM_ID3" value="0x3" caption="Fault 3 - MAIN_OSC_PMC"/>
              <param name="FAULT_PWM_ID4" value="0x4" caption="Fault 4 - AFEC0"/>
              <param name="FAULT_PWM_ID5" value="0x5" caption="Fault 5 - AFEC1"/>
              <param name="FAULT_PWM_ID6" value="0x6" caption="Fault 6 - ACC"/>
              <param name="FAULT_PWM_ID7" value="0x7" caption="Fault 7 - TC1"/>
            </parameters>
          </instance>
        </module>
        <module name="QSPI" id="11171" version="J">
          <instance name="QSPI">
            <register-group address-space="base" name="QSPI" name-in-module="QSPI" offset="0x4007C000"/>
            <signals>
              <signal pad="PA11" function="A" group="QCS"/>
              <signal pad="PA13" function="A" group="QIO" index="0"/>
              <signal pad="PA12" function="A" group="QIO" index="1"/>
              <signal pad="PA17" function="A" group="QIO" index="2"/>
              <signal pad="PD31" function="A" group="QIO" index="3"/>
              <signal pad="PA14" function="A" group="QSCK"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="6"/>
              <param name="DMAC_ID_TX" value="5"/>
              <param name="INSTANCE_ID" value="43"/>
              <param name="CLOCK_ID" value="43"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="11009" version="N">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1800"/>
            <parameters>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="RSWDT" id="11110" version="G">
          <instance name="RSWDT">
            <register-group address-space="base" name="RSWDT" name-in-module="RSWDT" offset="0x400E1900"/>
            <parameters>
              <param name="INSTANCE_ID" value="63"/>
            </parameters>
          </instance>
        </module>
