zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70064.atdf
      <register-group caption="Rx FIFO 0 Element" name="MCAN_RXF0E" aligned="4">
        <register caption="Rx FIFO 0 Element 0" name="MCAN_RXF0E_0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Identifier" mask="0x1FFFFFFF" name="ID"/>
          <bitfield caption="Remote Transmission Request" mask="0x20000000" name="RTR"/>
          <bitfield caption="Extended Identifier" mask="0x40000000" name="XTD"/>
          <bitfield caption="Error State Indicator" mask="0x80000000" name="ESI"/>
        </register>
        <register caption="Rx FIFO 0 Element 1" name="MCAN_RXF0E_1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Rx Timestamp" mask="0x0000FFFF" name="RXTS"/>
          <bitfield caption="Data Length Code" mask="0x000F0000" name="DLC"/>
          <bitfield caption="Bit Rate Switch" mask="0x00100000" name="BRS"/>
          <bitfield caption="FD Format" mask="0x00200000" name="FDF"/>
          <bitfield caption="Filter Index" mask="0x7F000000" name="FIDX"/>
          <bitfield caption="Accepted Non-matching Frame" mask="0x80000000" name="ANMF"/>
        </register>
        <register caption="Rx FIFO 0 Element Data" name="MCAN_RXF0E_DATA" offset="0x8" rw="RW" size="4">
          <bitfield caption="Data Byte 0" mask="0x000000FF" name="DB0"/>
          <bitfield caption="Data Byte 1" mask="0x0000FF00" name="DB1"/>
          <bitfield caption="Data Byte 2" mask="0x00FF0000" name="DB2"/>
          <bitfield caption="Data Byte 3" mask="0xFF000000" name="DB3"/>
        </register>
      </register-group>
      <register-group caption="Rx FIFO 1 Element" name="MCAN_RXF1E" aligned="4">
        <register caption="Rx FIFO 1 Element 0" name="MCAN_RXF1E_0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Identifier" mask="0x1FFFFFFF" name="ID"/>
          <bitfield caption="Remote Transmission Request" mask="0x20000000" name="RTR"/>
          <bitfield caption="Extended Identifier" mask="0x40000000" name="XTD"/>
          <bitfield caption="Error State Indicator" mask="0x80000000" name="ESI"/>
        </register>
        <register caption="Rx FIFO 1 Element 1" name="MCAN_RXF1E_1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Rx Timestamp" mask="0x0000FFFF" name="RXTS"/>
          <bitfield caption="Data Length Code" mask="0x000F0000" name="DLC"/>
          <bitfield caption="Bit Rate Switch" mask="0x00100000" name="BRS"/>
          <bitfield caption="FD Format" mask="0x00200000" name="FDF"/>
          <bitfield caption="Filter Index" mask="0x7F000000" name="FIDX"/>
          <bitfield caption="Accepted Non-matching Frame" mask="0x80000000" name="ANMF"/>
        </register>
        <register caption="Rx FIFO 1 Element Data" name="MCAN_RXF1E_DATA" offset="0x8" rw="RW" size="4">
          <bitfield caption="Data Byte 0" mask="0x000000FF" name="DB0"/>
          <bitfield caption="Data Byte 1" mask="0x0000FF00" name="DB1"/>
          <bitfield caption="Data Byte 2" mask="0x00FF0000" name="DB2"/>
          <bitfield caption="Data Byte 3" mask="0xFF000000" name="DB3"/>
        </register>
      </register-group>
      <register-group caption="Tx Buffer Element" name="MCAN_TXBE" aligned="4">
        <register caption="Tx Buffer Element 0" name="MCAN_TXBE_0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Identifier" mask="0x1FFFFFFF" name="ID"/>
          <bitfield caption="Remote Transmission Request" mask="0x20000000" name="RTR"/>
          <bitfield caption="Extended Identifier" mask="0x40000000" name="XTD"/>
          <bitfield caption="Error State Indicator" mask="0x80000000" name="ESI"/>
        </register>
        <register caption="Tx Buffer Element 1" name="MCAN_TXBE_1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Data Length Code" mask="0x000F0000" name="DLC"/>
          <bitfield caption="Bit Rate Switch" mask="0x00100000" name="BRS"/>
          <bitfield caption="FD Format" mask="0x00200000" name="FDF"/>
          <bitfield caption="Event FIFO Control" mask="0x00800000" name="EFC"/>
          <bitfield caption="Message Marker" mask="0xFF000000" name="MM"/>
        </register>
        <register caption="Tx Buffer Element Data" name="MCAN_TXBE_DATA" offset="0x8" rw="RW" size="4">
          <bitfield caption="Data Byte 0" mask="0x000000FF" name="DB0"/>
          <bitfield caption="Data Byte 1" mask="0x0000FF00" name="DB1"/>
          <bitfield caption="Data Byte 2" mask="0x00FF0000" name="DB2"/>
          <bitfield caption="Data Byte 3" mask="0xFF000000" name="DB3"/>
        </register>
      </register-group>
      <register-group caption="Tx Event FIFO Element" name="MCAN_TXEFE" aligned="4">
        <register caption="Tx Event FIFO Element 0" name="MCAN_TXEFE_0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Identifier" mask="0x1FFFFFFF" name="ID"/>
          <bitfield caption="Remote Transmission Request" mask="0x20000000" name="RTR"/>
          <bitfield caption="Extended Identifier" mask="0x40000000" name="XTD"/>
          <bitfield caption="Error State Indicator" mask="0x80000000" name="ESI"/>
        </register>
        <register caption="Tx Event FIFO Element 1" name="MCAN_TXEFE_1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Tx Timestamp" mask="0x0000FFFF" name="TXTS"/>
          <bitfield caption="Data Length Code" mask="0x000F0000" name="DLC"/>
          <bitfield caption="Bit Rate Switch" mask="0x00100000" name="BRS"/>
          <bitfield caption="FD Format" mask="0x00200000" name="FDF"/>
          <bitfield caption="Event Type" mask="0x00C00000" name="ET" values="MCAN_TXEFE_1__ET"/>
          <bitfield caption="Message Marker" mask="0xFF000000" name="MM"/>
        </register>
      </register-group>
      <register-group caption="Standard Message ID Filter Element" name="MCAN_SIDFE" aligned="4">
        <register caption="Standard Message ID Filter Element 0" name="MCAN_SIDFE_0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Standard Filter ID 2" mask="0x000007FF" name="SFID2"/>
          <bitfield caption="Standard Filter ID 1" mask="0x07FF0000" name="SFID1"/>
          <bitfield caption="Standard Filter Element Configuration" mask="0x38000000" name="SFEC" values="MCAN_SIDFE_0__SFEC"/>
          <bitfield caption="Standard Filter Type" mask="0xC0000000" name="SFT" values="MCAN_SIDFE_0__SFT"/>
        </register>
      </register-group>
      <register-group caption="Extended Message ID Filter Element" name="MCAN_XIDFE" aligned="4">
        <register caption="Extended Message ID Filter Element 0" name="MCAN_XIDFE_0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Extended Filter ID 1" mask="0x1FFFFFFF" name="EFID1"/>
          <bitfield caption="Extended Filter Element Configuration" mask="0xE0000000" name="EFEC" values="MCAN_XIDFE_0__EFEC"/>
        </register>
        <register caption="Extended Message ID Filter Element 1" name="MCAN_XIDFE_1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Extended Filter ID 2" mask="0x1FFFFFFF" name="EFID2"/>
          <bitfield caption="Extended Filter Type" mask="0xC0000000" name="EFT" values="MCAN_XIDFE_1__EFT"/>
        </register>
      </register-group>
      <value-group caption="" name="MCAN_DBTP__TDC">
        <value caption="Transmitter Delay Compensation disabled." name="DISABLED" value="0"/>
        <value caption="Transmitter Delay Compensation enabled." name="ENABLED" value="1"/>
      </value-group>
