zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cz_ca/pic32cz_ca70/atdf/PIC32CZ2051CA70064.atdf
        <register caption="QDEC Interrupt Enable Register" name="TC_QIER" offset="0xC8" rw="W" size="4">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Consecutive Missing Pulse Error" mask="0x00000008" name="MPE"/>
        </register>
        <register caption="QDEC Interrupt Disable Register" name="TC_QIDR" offset="0xCC" rw="W" size="4">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Consecutive Missing Pulse Error" mask="0x00000008" name="MPE"/>
        </register>
        <register caption="QDEC Interrupt Mask Register" name="TC_QIMR" offset="0xD0" rw="R" size="4">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Consecutive Missing Pulse Error" mask="0x00000008" name="MPE"/>
        </register>
        <register caption="QDEC Interrupt Status Register" name="TC_QISR" offset="0xD4" rw="R" size="4">
          <bitfield caption="Index" mask="0x00000001" name="IDX"/>
          <bitfield caption="Direction Change" mask="0x00000002" name="DIRCHG"/>
          <bitfield caption="Quadrature Error" mask="0x00000004" name="QERR"/>
          <bitfield caption="Consecutive Missing Pulse Error" mask="0x00000008" name="MPE"/>
          <bitfield caption="Direction" mask="0x00000100" name="DIR"/>
        </register>
        <register caption="Fault Mode Register" name="TC_FMR" offset="0xD8" rw="RW" size="4">
          <bitfield caption="Enable Compare Fault Channel 0" mask="0x00000001" name="ENCF0"/>
          <bitfield caption="Enable Compare Fault Channel 1" mask="0x00000002" name="ENCF1"/>
        </register>
        <register caption="Write Protection Mode Register" name="TC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="TC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="TC_CMR0__TCCLKS">
        <value caption="Clock selected: internal PCK6 clock signal (from PMC)" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: internal MCK/8 clock signal (from PMC)" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: internal MCK/32 clock signal (from PMC)" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: internal MCK/128 clock signal (from PMC)" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: internal SLCK clock signal (from PMC)" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOAx" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOAx" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOAx" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOAx" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOAx" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOAx" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__SBSMPLR">
        <value caption="Load a Capture Register each selected edge" name="ONE" value="0x0"/>
        <value caption="Load a Capture Register every 2 selected edges" name="HALF" value="0x1"/>
        <value caption="Load a Capture Register every 4 selected edges" name="FOURTH" value="0x2"/>
        <value caption="Load a Capture Register every 8 selected edges" name="EIGHTH" value="0x3"/>
        <value caption="Load a Capture Register every 16 selected edges" name="SIXTEENTH" value="0x4"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__EEVTEDG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edges" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__EEVT">
        <value caption="TIOB" name="TIOB" value="0x0"/>
        <value caption="XC0" name="XC0" value="0x1"/>
        <value caption="XC1" name="XC1" value="0x2"/>
        <value caption="XC2" name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__WAVSEL">
        <value caption="UP mode without automatic trigger on RC Compare" name="UP" value="0x0"/>
        <value caption="UPDOWN mode without automatic trigger on RC Compare" name="UPDOWN" value="0x1"/>
        <value caption="UP mode with automatic trigger on RC Compare" name="UP_RC" value="0x2"/>
        <value caption="UPDOWN mode with automatic trigger on RC Compare" name="UPDOWN_RC" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ACPA">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ACPC">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__AEEVT">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ASWTRG">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BCPB">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BCPC">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
